software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/InsertOrderDetails.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <InsertRequest xmlns="http://wapi.wustl.edu/WAPI">
            <object>
                <ns1:AbstractDomainObject comment="Comments 55" identifier="0" name="Order name 55" status="New"
                                          xsi:type="ns2:OrderDetails"
                                          xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.common.domain.ws"
                                          xmlns:ns2="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">
                    <ns2:distributionProtocol>
                        <ns2:DistributionProtocol identifier="2"/>
                    </ns2:distributionProtocol>

                    <ns2:orderItemCollection>
                        <ns2:OrderItem description="desc 00" identifier="0" requestedQuantity="0.1" status="New"
                                       xsi:type="ns2:SpecimenOrderItem"/>
                        <ns2:OrderItem description="desc 01" identifier="0" requestedQuantity="0.2" status="New"
                                       xsi:type="ns2:SpecimenOrderItem"/>
                        <ns2:OrderItem description="desc 02" identifier="0" requestedQuantity="0.3" status="New"
                                       xsi:type="ns2:SpecimenOrderItem"/>
                    </ns2:orderItemCollection>
                </ns1:AbstractDomainObject>
            </object>
        </InsertRequest>
    </soapenv:Body>
</soapenv:Envelope>