software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/UpdateCollectionProtocol.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <UpdateRequest xmlns="http://wapi.wustl.edu/WAPI">
            <object>
                <ns1:AbstractDomainObject activityStatus="Active"
                                          aliquotInSameContainer="false"
                                          consentsWaived="false"
                                          dirtyEditFlag="false"
                                          identifier="490"
                                          remoteId="100"
                                          remoteManagedFlag="false"
                                          shortTitle="CP Short Title - 100"
                                          startDate="2011-08-09T20:01:53.022Z"
                                          studyCalendarEventPoint="0.0"
                                          title="CP Title - 100"
                                          type="Type-01"
                                          xsi:type="ns2:CollectionProtocol"
                                          xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.common.domain.ws"
                                          xmlns:ns2="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">
                    <ns2:principalInvestigator>
                        <ns2:User csmUserId="0" dirtyEditFlag="false" firstTimeLogin="false" identifier="1" remoteId="0"
                                  remoteManagedFlag="false"/>
                    </ns2:principalInvestigator>
                    <ns2:coordinatorCollection>
                        <ns2:User csmUserId="0" dirtyEditFlag="false" firstTimeLogin="false" identifier="3" remoteId="0"
                                  remoteManagedFlag="false"/>
                    </ns2:coordinatorCollection>
                </ns1:AbstractDomainObject>
            </object>
        </UpdateRequest>
    </soapenv:Body>
</soapenv:Envelope>