software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/DisableParticipant.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <DisableRequest xmlns="http://wapi.wustl.edu/WAPI">
            <object>
                <ns1:AbstractDomainObject
                        activityStatus="Active"
                        firstName="AAA"
                        identifier="900"
                        lastName="BBB"
                        xsi:type="ns2:Participant"
                        xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.common.domain.ws"
                        xmlns:ns2="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws" />
            </object>
        </DisableRequest>
    </soapenv:Body>
</soapenv:Envelope>