software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/InsertDistribution.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <InsertRequest xmlns="http://wapi.wustl.edu/WAPI">
            <object>
                <ns1:AbstractDomainObject activityStatus="Active" comment="COMM" identifier="0"
                                          xsi:type="ns2:Distribution"
                                          xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.common.domain.ws"
                                          xmlns:ns2="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">

                    <ns2:distributionProtocol><ns2:DistributionProtocol identifier="26"/></ns2:distributionProtocol>

                    <ns2:orderDetails>
                        <ns2:OrderDetails identifier="6" />
                    </ns2:orderDetails>

                    <ns2:toSite><ns2:Site identifier="1"/></ns2:toSite>

                    <ns2:distributedItemCollection>
                        <ns2:DistributedItem identifier="0" quantity="0.3">
                            <ns2:specimen><ns2:Specimen identifier="19" /></ns2:specimen>
                        </ns2:DistributedItem>
                    </ns2:distributedItemCollection>

                    <ns2:distributedBy><ns2:User identifier="1" /></ns2:distributedBy>

                </ns1:AbstractDomainObject>
            </object>
        </InsertRequest>
    </soapenv:Body>
</soapenv:Envelope>