software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/InsertStorageContainer.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <InsertRequest xmlns="http://wapi.wustl.edu/WAPI">
            <object>
                <ns1:AbstractDomainObject activityStatus="Active"
                                          full="false"
                                          identifier="0"
                                          temperatureInCentigrade="-20.0"
                                          xsi:type="ns2:StorageContainer"
                                          xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.common.domain.ws"
                                          xmlns:ns2="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">

                    <ns2:capacity><ns2:Capacity identifier="0" oneDimensionCapacity="10" twoDimensionCapacity="10"/></ns2:capacity>
                    <ns2:holdsSpecimenTypeCollection><ns2:string>Serum</ns2:string></ns2:holdsSpecimenTypeCollection>
                    <ns2:holdsSpecimenClassCollection><ns2:string>Fluid</ns2:string></ns2:holdsSpecimenClassCollection>
                    <ns2:site><ns2:Site dirtyEditFlag="false" identifier="1" remoteId="0" remoteManagedFlag="false"/></ns2:site>
                    <ns2:storageType><ns2:StorageType defaultTemperatureInCentigrade="0.0" identifier="1"/></ns2:storageType>

                    <ns2:collectionProtocolCollection>
                        <ns2:CollectionProtocol identifier="3" />
                    </ns2:collectionProtocolCollection>

                </ns1:AbstractDomainObject>
            </object>
        </InsertRequest>
    </soapenv:Body>
</soapenv:Envelope>