software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/UpdateParticipant.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <UpdateRequest xmlns="http://wapi.wustl.edu/WAPI">
            <object>
                <ns1:AbstractDomainObject activityStatus="Active"
                                          firstName="Johnathan"
                                          lastName="Nolastname"
                                          socialSecurityNumber="555-55-5555"
                                          identifier="900"
                                          vitalStatus="Alive"
                                          gender="Male Gender"
                                          xsi:type="ns2:Participant"
                                          xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.common.domain.ws"
                                          xmlns:ns2="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">
                </ns1:AbstractDomainObject>
            </object>
        </UpdateRequest>
    </soapenv:Body>
</soapenv:Envelope>